Autodesk.Navisworks.Api.Plugins.RenderPluginRecord
Represents an RenderPlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.RenderPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.RenderPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.RenderPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load